%%=======================================_Lab_3_=========================================

% Определить предикат quicksort(L, K) который для заданного списка целых чисел возвращает отсортированный

%========================================================================================

quicksort(L,K):-
  L = [Head|Tail],
	part(Head, Tail, List1, List2),
	quicksort(List1, Sorted1),
	quicksort(List2, Sorted2),
	append(Sorted1, [Head|Sorted2], K).

quicksort([], []).

part(Current, [Head|Tail], [Head|LowEq], High):-
	Current >= Head,
	part(Current, Tail, LowEq, High).

part(Current, [Head|Tail], LowEq, [Head|High]):-
	part(Current, Tail, LowEq, High).

part(_, [], [], []).

%========================================================================================

test:-
	List = [ 51, 32, -10, 65, 11, 73, 98, 47, 0, -5 ],
	quicksort(List, Sorted),
  write(Sorted).

:- test.

%========================================================================================
/*
input: [ 51, 32, -10, 65, 11, 73, 98, 47, 0, -5 ],
output: [-10,-5,0,11,32,47,51,65,73,98]
*/
%========================================================================================
